print('안녕하세요')
print("안녕하세요라고 \t 말했습니다")

print("이름\t나이\t지역")
print("정상수\t25\t강서구")
print("박찬우\t24\t강서구")
print("구름\t3\t정상수")

print("안녕"+"하세요")
print("안녕하세요" *3)
print("안녕하세요 정상수입니다" *3)

print("문자 선택 연산자에 대해 알아보자")
print("안녕하세요"[0])  # 인덱싱은 0부터 시작
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])


print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])

print("정상수입니다"[1:4]) # 1번부터 3번까지 출력 
print("정상수입니다"[0:2]) # 1번부터 2번까지 출력
print("안녕하세요 정상수입니다"[1:3]) # 1번부터 2번까지 출력
print("안녕하세요"[2:4]) # 2번부터 3번까지 출력 

print("정상수입니다"[1:]) # 1번부터 끝까지
print('안녕하세요'[:3]) # 0번째부터 3번째 앞의 문자까지 

print(" # 연습문제")
print("\\\\\\\\")
print("-" *8)